<?php
/*
in The name of god
by: Amirhossein rezaii
tel: @developer_001
*/
 if($textmassage=="/help" or $textmassage=="راهنما" or $textmassage=="help"){
	 if ($tc == 'group' | $tc == 'supergroup'){  
	Telegram('sendmessage',[
	'chat_id'=>$chat_id,
	'text'=>"🚩به راهنمای ربات مدیریت گروه خوش امدید
➖➖➖➖➖➖➖➖
🔖لطفا زبان مورد نظر برای دستورات را انتخاب کنید

💥در راهنما به نکات زیر توجه کنید

🔹🔸🔹🔸🔹🔸🔹🔸🔹🔸🔹

🔹برای دستورات انگلیسی ان هارو تایپ کنید و روی ان ها کلیک نکنید!

🔸در جای که علامت های [] وجود دارد در دستورات از ان ها استفاده نکنید
➖➖➖",
	   'reply_markup'=>json_encode([
    'inline_keyboard'=>[
 	[
	  ['text'=>"🇮🇷 فارسی",'callback_data'=>"farsi"],['text'=>"🇬🇧 انگلیسی",'callback_data'=>"english"]
	  ],
	  	  	 [
				 ['text'=>"🎉 کانال ما",'url'=>"https://telegram.me/$channel"],['text'=>"✖️ خروج",'callback_data'=>'exit']
		 ],
   ]
   ])
   ]);
   }  
  }
elseif($textmassage=="🗄 دستورات و امکانات"){
	Telegram('sendmessage',[
	'chat_id'=>$chat_id,
	'text'=>"📍 راهنمای دستورات مدیریتی کلی ربات:
راهنمای دستورات قفلی :
➖➖➖➖➖
🔐قفل لینک
🔓بازکردن لینک 
/lock link
/unlock link
〰〰〰
🔐قفل تگ
🔓بازکردن تگ
/lock tag
/unlock tag
〰〰〰
🔐قفل یوزرنیم
🔓بازکرن یوزرنیم
/lock username
/unlock username
〰〰〰
🔐قفل تبچی
🔓بازکرن تبچی
/lock tabchi
/unlock tabchi
〰〰〰
🔐قفل متن
🔓بازکردن متن
/lock text
/unlock text
〰〰〰
🔐قفل ویرایش
🔓بازکردن ویرایش
/lock edit
/unlock edit
〰〰〰
🔐قفل ربات
🔓بازکردن ربات
/lock bots
/unlock bots
〰〰〰
🔐قفل فحش
🔓بازکردن فحش
/lock fosh
/unlock fosh
〰〰〰
🔐قفل گیف
🔓بازکردن گیف
/lock gif
/unlock gif
〰〰〰
🔐قفل عکس
🔓بازکردن عکس
/lock photo
/unlock photo
〰〰〰
🔐قفل فیلم
🔓بازکردن فیلم
/lock video
/unlock video
〰〰〰
🔐قفل آهنگ
🔓بازکردن آهنگ
/lock audio
/unlock audio
〰〰〰
🔐قفل ویس
🔓بازکردن ویس
/lock voice
/unlock voice
〰〰〰
🔐قفل استیکر
🔓بازکردن استیکر
/lock sticker
/unlock sticker
〰〰〰
🔐قفل مخاطب
🔓بازکردن مخاطب
/lock contact
/unlock contact
〰〰〰
🔐قفل فوروارد
🔓بازکردن فوروارد
/lock forward
/unlock forward
〰〰〰
🔐قفل مکان
🔓بازکردن مکان
/lock location
/unlock location
〰〰〰
🔐قفل فایل
🔓بازکردن فایل
/lock document
/unlock document
〰〰〰
🔐قفل بازی
🔓بازکردن بازی
/lock game
/unlock game
〰〰〰
🔐قفل پیام ویدیویی
🔓بازکردن پیام ویدیویی
/lock videonote
/unlock videonote
〰〰〰
🔐قفل ریپلای
🔓بازکردن ریپلای
/lock reply
/unlock reply
〰〰〰
🔐قفل دستورات
🔓بازکردن دستورات
/lock cmd
/unlock cmd
〰〰〰
🔐قفل خدمات
🔓بازکردن خدمات
/lock tgservic
/unlock tgservic

ایموجی های ابتدای دستورات را وارد نکنید
بازکردن و قفل کردن هم از طریق پنل و هم از طریق دستور ممکن است
➰➰➰➰➰➰➰➰➰
راهنمای دستورات عمومی :
/rules
🔺قوانین گروه
/link
🔺لینک گروه
/id
🔺ایدی
/id [ریپلای]
🔺ایدی (ریپلای)
/me
🔺من
/info
🔺اطلاعات گروه
/info [ریپلای| ایدی]
🔺اطلاعات (ریپلای)
/ping
🔺ربات_ زنده ایی _انلاینی
➰➰➰➰➰➰➰➰➰➰
راهنمای دستورات مدیریتی :
/panel 
🔺پنل
/settings
🔺 تنظیمات
/promote [ریپلای]
🔺ترفیع (مقام)
/demote [ریپلای]
🔺تنزل (مقام)
/admin list 
🔺لیست ادمین
/pin [ریپلای]
🔺سنجاق
/unpin 
🔺حذف سنجاق
/kick [ریپلای | ایدی]
🔺اخراج فرد
/del [ریپلای]
🔺حذف (ریپلای)
/rmsg [1-300]
🔺پاک کردن (1_300)
/setname [نام]
🔺تنظیم نام (نام)
/setdescription [متن]
🔺تنظیم اطلاعات (متن)
/automatic
🔺مدیریت خودکار
/mute all
🔺بیصدا همه
/unmute all
🔺باصدا همه
/filter
🔺افزودن فیلتر (متن)
/unfilter
🔺حذف فیلتر (متن)
/add [on | off]
🔺اخطار
/unwarn [ریپلای]
🔺حذف اخطار 
/setrules [متن]
🔺تنظیم قوانین (متن)
/modebot [on | off]
🔺سختگیرانه ربات (روشن،خاموش)
/modewarn [on | off]
🔺سختگیرانه اخطار (روشن،خاموش)
➰➰➰➰➰➰➰➰➰➰
برای دستورات انگلیسی ان هارو تایپ کنید و روی ان ها کلیک نکنید!
در جای که علامت های [] و () وجود دارد در دستورات از ان ها استفاده نکنید
➖➖➖",
  'reply_markup'=>json_encode([
                   'inline_keyboard'=>[
					 [
					 ['text'=>"دستورات فارسی",'callback_data'=>'farese'],['text'=>"دستورات انگلیسی",'callback_data'=>'engi']
					 ],
					 [
					 ['text'=>"دستورات کلی",'callback_data'=>'koali']
					 ],
                     ]
                               
               ])
           ]);
   }  
   
   elseif($data=="farese"){
            Telegram('editmessagetext',[
                'chat_id'=>$chatid,
     'message_id'=>$messageid,
               'text'=>" 
📍 راهنمای دستورات قفلی :
➖➖➖
📌پاک کردن لینک 
🔹قفل لینک
🔸بازکردن لینک
〰〰〰
📌پاک کرد هشتگ
🔹قفل تگ
🔸بازکردن تگ
〰〰〰
📌پاک کردن یوزرنیم
🔹قفل یوزرنیم
🔸بازکردن یوزرنیم
〰〰〰
📌پاک کردن متن
🔹قفل متن
🔸بازکردن متن
〰〰〰
📌پاک کردن ویرایش پیام
🔹قفل ویرایش
🔸بازکردن ویرایش
〰〰〰
📌پاک کردن ربات های مخرب
🔹قفل ربات
🔸بازکردن ربات
〰〰〰
📌پاک کردن کلمات رکیک
🔹قفل فحش
🔸بازکردن فحش
〰〰〰
📌پاک کردن تصاویر متحرک
🔹قفل گیف
🔸بازکردن گیف
〰〰〰
📌پاک کردن عکس
🔹قفل عکس
🔸بازکردن عکس
〰〰〰
📌پاک کردن فیلم
🔹قفل ویدیو
🔸بازکردن ویدیو
〰〰〰
📌پاک کردن اهنگ
🔹قفل اهنگ
🔸بازکردن اهنگ
〰〰〰
📌پاک کردن ویس
🔹قفل ویس
🔸بازکردن ویس
〰〰〰
📌پاک کردن استیکر
🔹قفل استیکر
🔸بازکردن استیکر
〰〰〰
📌پاک کردن ارسال مخاطب
🔹قفل مخاطب
🔸بازکردن مخاطب
〰〰〰
📌پاک کردن فوروارد
🔹قفل فوروارد
🔸بازکردن فوروارد
〰〰〰
📌پاک کردن ارسال مکان
🔹قفل مکان
🔸بازکردن مکان
〰〰〰
📌پاک کردن ارسال فایل
🔹قفل فایل
🔸بازکردن فایل
〰〰〰
📌پاک کردن بازی تحت وب
🔹قفل بازی
🔸بازکردن بازی
〰〰〰
📌پاک کردن پیام ویدیویی
🔹قفل پیام ویدیویی
🔸بازکردن پیام ویدیویی
〰〰〰
📌پاک کردن ریپلای کردن پیام
🔹قفل ریپلای
🔸بازکردن ریپلای
〰〰〰
📌جلو گیری از دستورات عمومی
🔹قفل دستورات
🔸بازکردن دستورات
〰〰〰
📌قفل خدمات تلگرام
🔹قفل خدمات
🔸بازکردن خدمات
〰〰〰
📌خاموش و روشن کردن قفل خودکار گروه
🔹قفل خودکار روشن
🔸قفل خودکار خاموش
❄️تنظیم قفل خودکار [زمان پایان زمان شروع] 
📍 زمان را باید با فرمت صحیح استفاده کنید مثال :
تنظیم قفل خودکار 13:36 19:05
〰〰〰
📌خاموش و روشن کردن و تنظیم کاراکتر پیام
🔹قفل کاراکتر
🔸بازکردن کاراکتر
❄️تنظیم کاراکتر [حداقل کاراکتر حداکثر کاراکتر]
📍 باید حتما به عدد وارد کنید مثال :
تنظیم کاراکتر 10 320

➖➖➖
🔹ایموجی های ابتدای دستورات را وارد نکنید

🔖بازکردن و قفل کردن هم از طریق پنل و هم از طریق دستور ممکن است

🔸مثال :
قفل لینک
بازکردن لینک
➖➖➖
",
               'reply_markup'=>json_encode([
                   'inline_keyboard'=>[
					 [
					 ['text'=>"دستورات فارسی",'callback_data'=>'farese'],['text'=>"دستورات انگلیسی",'callback_data'=>'engi']
					 ],
					[
					 ['text'=>"دستورات کلی",'callback_data'=>'koali']
					 ],
                     ]
               ])
           ]);
}
   
      elseif($data=="engi"){
            Telegram('editmessagetext',[
                'chat_id'=>$chatid,
     'message_id'=>$messageid,
               'text'=>" 
📍 راهنمای دستورات مدیریتی :
➖➖
/panel
💭دریافت پنل تنظیمات و پنل مدیریت گروه

/settings
💭دریافت تنظیمات گروه به صورت متنی

/promote [ریپلای]
💭ادمین کرد فرد مورد نظر

/demote [ریپلای]
💭تنزل مقام فرد مورد نظر

/admin list 
💭دریافت لیست ادمین های گروه

/pin [ریپلای]
💭سنحاق کردن پیام مورد نظر توسط ربات

/unpin 
💭برداشتن پیام از حالت سنجاق

/kick [ریپلای | ایدی]
💭اخراج فرد مورد نظر از گروه

/del [ریپلای]
💭حذف پیام مورد نظر

/rmsg [1-300]
💭پاک کردن پیام های اخیر گروه

/setname [نام]
💭تنظیم نام گروه

/setdescription [متن]
💭تنظیم اطلاعات گروه

/delphoto 
??حذف عکس گروه

/setphoto [ریپلای]
💭تنظیم عکس گروه

/automatic
💭فعال کردن قفل ها به صورت خودکار و مدیریت خود کار گروه

/mute all
💭ساکت کردن همه گروه

/unmute all
💭غیر فعال کردن سکوت گروه

/welcome [enable |disable]
💭روشن و خاموش کردن خوش امد

/setwelcome [متن]
💭تنظیم پیام خوش امد

/silent
💭افزودن فرد به لیست سکوت گروه

/silent [دقیقه]
💭افزودن فرد به لیست سکوت گروه به صورت زمان داره

/unsilent
💭خارج کردن فرد از لیست سکوت گروه

/list silent
💭دریافت لیست سکوت گروه

/clean silentlist
💭 پاک کردن لیست سکوت گروه

/request
💭درخواست تمدید شارژ برای گروه

/filter
💭افزودن کلمه به لیست کلمات فیلترشده

/unfilter
💭حذف کلمه از لیست کلمات فیلتر شده

/filterlist
💭دریافت لیست کلمات فیلتر شد

/clean filterlist
💭پاک کردن تمام کلمات درون لیست فیلتر

/restart settings
💭ریستارت کردن تنظیمات گروه به حالت اولیه

/add [on | off]
💭روشن و خاموش کردن اد اجباری در گروه

/setadd [عدد]
💭تنظیم مقدار کاربری که یک فرد باید دعوت کند تا بتواند در گروه چت کند

/setwarn [عدد]
💭 تنظیم حداکثر اخطار برای کاربر

/warn [ریپلای]
💭اخطار دادن به کاربر مورد نظر

/unwarn [ریپلای]
💭کم کردن اخطار های کاربر مورد نظر

/warn info [ریپلای]
💭به دست اوردن تعداد اخطار های کاربر

/setrules [متن]
💭تنظیم قوانین گروه

/muteall [دقیقه]
💭سکوت همه به صورت زمان دار

/channel [on | off]
💭روشن و خاموش کردن قفل کانال

/setchannel [@یوزرنیم کانال]
💭 قفل کردن ربات روی کانال تنظیم شد

/modebot [on | off]
💭 روشن و خاموش کردن حالت سختگیرانه اضافه کردن ربات

/modewarn [on | off]
💭 روشن و خاموش کردن حالت سختگیرانه اخراج کاربر پس از رسیدن به حداکثر اخطار

/delall
💭 پاکسازی پیام های اخیر گروه تا حد ممکن

➖➖
🔹برای دستورات انگلیسی ان هارو تایپ کنید و روی ان ها کلیک نکنید!

🔸در جای که علامت های [] وجود دارد در دستورات از ان ها استفاده نکنید

✨مثال :
/setrules hi
➖➖➖
📍 راهنمای دستورات قفلی :
➖➖
📌پاک کردن لینک 
/lock link
/unlock link
〰〰〰
📌پاک کرد هشتگ
/lock tag
/unlock tag
〰〰〰
📌پاک کردن یوزرنیم
/lock username
/unlock username
〰〰〰
📌پاک کردن متن
/lock text
/unlock text
〰〰〰
📌پاک کردن ویرایش پیام
/lock edit
/unlock edit
〰〰〰
📌پاک کردن ربات های مخرب
/lock bots
/unlock bots
〰〰〰
📌پاک کردن کلمات رکیک
/lock fosh
/unlock fosh
〰〰〰
📌پاک کردن تصاویر متحرک
/lock gif
/unlock gif
〰〰〰
📌پاک کردن عکس
/lock photo
/unlock photo
〰〰〰
📌پاک کردن فیلم
/lock video
/unlock video
〰〰〰
📌پاک کردن اهنگ
/lock audio
/unlock audio
〰〰〰
📌پاک کردن ویس
/lock voice
/unlock voice
〰〰〰
📌پاک کردن استیکر
/lock sticker
/unlock sticker
〰〰〰
📌پاک کردن ارسال مخاطب
/lock contact
/unlock contact
〰〰〰
📌پاک کردن فوروارد
/lock forward
/unlock forward
〰〰〰
📌پاک کردن ارسال مکان
/lock location
/unlock location
〰〰〰
📌پاک کردن ارسال فایل
/lock document
/unlock document
〰〰〰
📌پاک کردن بازی تحت وب
/lock game
/unlock game
〰〰〰
📌پاک کردن پیام ویدیویی
/lock videonote
/unlock videonote
〰〰〰
📌پاک کردن ریپلای کردن پیام
/lock reply
/unlock reply
〰〰〰
📌جلو گیری از دستورات عمومی
/lock cmd
/unlock cmd
〰〰〰
📌قفل خدمات تلگرام
/lock tgservic
/unlock tgservic
〰〰〰
📌خاموش و روشن کردن قفل خودکار گروه
/lock auto
/unlock auto
/setlockauto [زمان پایان زمان شروع]
📍 زمان را باید با فرمت صحیح استفاده کنید مثال :
/setlockauto 13:36 19:05
〰〰〰
📌خاموش و روشن کردن و تنظیم کاراکتر پیام
/lock character
/unlock character
/setlockcharacter [حداقل کاراکتر حداکثر کاراکتر]
📍 باید حتما به عدد وارد کنید مثال :
/setlockcharacter 10 320

➖➖➖
🔹برای دستورات انگلیسی ان هارو تایپ کنید و روی ان ها کلیک نکنید!

🔖بازکردن و قفل کردن هم از طریق پنل و هم از طریق دستور ممکن است

🔸مثال :
/lock link
/unlock link
➖➖
",
               'reply_markup'=>json_encode([
                   'inline_keyboard'=>[
					 [
					 ['text'=>"دستورات فارسی",'callback_data'=>'farese'],['text'=>"دستورات انگلیسی",'callback_data'=>'engi']
					 ],
					[
					 ['text'=>"دستورات کلی",'callback_data'=>'koali']
					 ],
                     ]
               ])
           ]);
}
elseif($data=="koali"){
            Telegram('editmessagetext',[
                'chat_id'=>$chatid,
     'message_id'=>$messageid,
               'text'=>" 
راهنمای دستورات قفلی کلی:
➖➖➖➖➖
🔐قفل لینک
🔓بازکردن لینک 
/lock link
/unlock link
〰〰〰
🔐قفل تگ
🔓بازکردن تگ
/lock tag
/unlock tag
〰〰〰
🔐قفل یوزرنیم
🔓بازکرن یوزرنیم
/lock username
/unlock username
〰〰〰
🔐قفل متن
🔓بازکردن متن
/lock text
/unlock text
〰〰〰
🔐قفل ویرایش
🔓بازکردن ویرایش
/lock edit
/unlock edit
〰〰〰
🔐قفل ربات
🔓بازکردن ربات
/lock bots
/unlock bots
〰〰〰
🔐قفل فحش
🔓بازکردن فحش
/lock fosh
/unlock fosh
〰〰〰
🔐قفل گیف
🔓بازکردن گیف
/lock gif
/unlock gif
〰〰〰
🔐قفل عکس
🔓بازکردن عکس
/lock photo
/unlock photo
〰〰〰
🔐قفل فیلم
🔓بازکردن فیلم
/lock video
/unlock video
〰〰〰
🔐قفل آهنگ
🔓بازکردن آهنگ
/lock audio
/unlock audio
〰〰〰
🔐قفل ویس
🔓بازکردن ویس
/lock voice
/unlock voice
〰〰〰
🔐قفل استیکر
🔓بازکردن استیکر
/lock sticker
/unlock sticker
〰〰〰
🔐قفل مخاطب
🔓بازکردن مخاطب
/lock contact
/unlock contact
〰〰〰
🔐قفل فوروارد
🔓بازکردن فوروارد
/lock forward
/unlock forward
〰〰〰
🔐قفل مکان
🔓بازکردن مکان
/lock location
/unlock location
〰〰〰
🔐قفل فایل
🔓بازکردن فایل
/lock document
/unlock document
〰〰〰
🔐قفل بازی
🔓بازکردن بازی
/lock game
/unlock game
〰〰〰
🔐قفل پیام ویدیویی
🔓بازکردن پیام ویدیویی
/lock videonote
/unlock videonote
〰〰〰
🔐قفل ریپلای
🔓بازکردن ریپلای
/lock reply
/unlock reply
〰〰〰
🔐قفل دستورات
🔓بازکردن دستورات
/lock cmd
/unlock cmd
〰〰〰
🔐قفل خدمات
🔓بازکردن خدمات
/lock tgservic
/unlock tgservic

ایموجی های ابتدای دستورات را وارد نکنید
بازکردن و قفل کردن هم از طریق پنل و هم از طریق دستور ممکن است
➰➰➰➰➰➰➰➰➰
راهنمای دستورات عمومی :
/rules
🔺قوانین گروه
/link
🔺لینک گروه
/id
🔺ایدی
/id [ریپلای]
🔺ایدی (ریپلای)
/me
🔺من
/info
🔺اطلاعات گروه
/info [ریپلای| ایدی]
🔺اطلاعات (ریپلای)
/ping
🔺ربات_ زنده ایی _انلاینی
➰➰➰➰➰➰➰➰➰➰
راهنمای دستورات مدیریتی :
/panel 
🔺پنل
/settings
🔺 تنظیمات
/promote [ریپلای]
🔺ترفیع (مقام)
/demote [ریپلای]
🔺تنزل (مقام)
/admin list 
🔺لیست ادمین
/pin [ریپلای]
🔺سنجاق
/unpin 
🔺حذف سنجاق
/kick [ریپلای | ایدی]
🔺اخراج فرد
/del [ریپلای]
🔺حذف (ریپلای)
/rmsg [1-300]
🔺پاک کردن (1_300)
/setname [نام]
🔺تنظیم نام (نام)
/setdescription [متن]
🔺تنظیم اطلاعات (متن)
/automatic
🔺مدیریت خودکار
/mute all
🔺بیصدا همه
/unmute all
🔺باصدا همه
/filter
🔺افزودن فیلتر (متن)
/unfilter
🔺حذف فیلتر (متن)
/add [on | off]
🔺اخطار
/unwarn [ریپلای]
🔺حذف اخطار 
/setrules [متن]
🔺تنظیم قوانین (متن)
/modebot [on | off]
🔺سختگیرانه ربات (روشن،خاموش)
/modewarn [on | off]
🔺سختگیرانه اخطار (روشن،خاموش)
➰➰➰➰➰➰➰➰➰➰
برای دستورات انگلیسی ان هارو تایپ کنید و روی ان ها کلیک نکنید!
در جای که علامت های [] و () وجود دارد در دستورات از ان ها استفاده نکنید
➖➖➖
",
               'reply_markup'=>json_encode([
                   'inline_keyboard'=>[
					 [
					 ['text'=>"دستورات فارسی",'callback_data'=>'farese'],['text'=>"دستورات انگلیسی",'callback_data'=>'engi']
					 ],
					[
					 ['text'=>"دستورات کلی",'callback_data'=>'koali']
					 ],
                     ]
               ])
           ]);
}
   	    elseif($data=="help"){
            Telegram('editmessagetext',[
                'chat_id'=>$chatid,
     'message_id'=>$messageid,
               'text'=>"🚩به راهنمای ربات مدیریت گروه خوش امدید
➖➖➖➖➖➖➖➖
🔖لطفا زبان مورد نظر برای دستورات را انتخاب کنید

💥در راهنما به نکات زیر توجه کنید

🔹🔸🔹🔸🔹🔸🔹🔸🔹🔸🔹

🔹برای دستورات انگلیسی ان هارو تایپ کنید و روی ان ها کلیک نکنید!

🔸در جای که علامت های [] وجود دارد در دستورات از ان ها استفاده نکنید
➖➖➖",
	   'reply_markup'=>json_encode([
    'inline_keyboard'=>[
 	[
	  ['text'=>"🇮🇷 فارسی",'callback_data'=>"farsi"],['text'=>"🇬🇧 انگلیسی",'callback_data'=>"english"]
	  ],
	  	  	 [
				 ['text'=>"🎉 کانال ما",'url'=>"https://telegram.me/$channel"],['text'=>"✖️ خروج",'callback_data'=>'exit']
		 ],
   ]
   ])
   ]);
   } 
	    elseif($data=="english"){
            Telegram('editmessagetext',[
                'chat_id'=>$chatid,
     'message_id'=>$messageid,
               'text'=>"به بخش دریافت دستورات انگلیسی خوش امدید❤️
➖➖➖➖➖➖➖➖
🔖لطفا بخش مورد نظر خورد را انتخاب کنید

➖➖➖➖

⚠️به نکات زیر توجه کنید :

🔹برای دیدن دستورات قفلی و مدیریتی شما باید حتما مدیر ربات باشید و کابران عادی اجازه ورود به این بخش را ندارند

💥دستورات عمومی برای همه کاربران است و همه اجازه استفاده از این دستورات را دارند

🎉دستورات صاحب ربات فقط برای سودو ربات هست و دیگر کاربران  اجازه ورود ندارند
➖➖➖",
               'reply_markup'=>json_encode([
                   'inline_keyboard'=>[
				    	[
	  ['text'=>"🚦 عمومی",'callback_data'=>"allen"],['text'=>"🔖 مدیریتی",'callback_data'=>"manageen"]
	  ],
	  				    	[
	  ['text'=>"🔐 قفل ها",'callback_data'=>"locken"],['text'=>"🤦🏻‍♂ صاحب ربات",'callback_data'=>"sudohelpen"]
	  ],
					 [
					 ['text'=>"🎉 کانال ما",'url'=>"https://telegram.me/$channel"],['text'=>"🔙 برگشت",'callback_data'=>'help']
					 ],
                     ]
               ])
           ]);
    }
		
		    elseif($data=="farsi"){
            Telegram('editmessagetext',[
                'chat_id'=>$chatid,
     'message_id'=>$messageid,
               'text'=>"به بخش دریافت دستورات فارسی خوش امدید❤️
➖➖➖➖➖➖➖➖
🔖لطفا بخش مورد نظر خورد را انتخاب کنید

➖➖➖➖

⚠️به نکات زیر توجه کنید :

🔹برای دیدن دستورات قفلی و مدیریتی شما باید حتما مدیر ربات باشید و کابران عادی اجازه ورود به این بخش را ندارند

💥دستورات عمومی برای همه کاربران است و همه اجازه استفاده از این دستورات را دارند

🎉دستورات صاحب ربات فقط برای سودو ربات هست و دیگر کاربران  اجازه ورود ندارند
➖➖➖",
               'reply_markup'=>json_encode([
                   'inline_keyboard'=>[
				    	[
	  ['text'=>"🚦 عمومی",'callback_data'=>"allfa"],['text'=>"🔖 مدیریتی",'callback_data'=>"managefa"]
	  ],
	  				    	[
	  ['text'=>"🔐 قفل ها",'callback_data'=>"lockfa"],['text'=>"🤦🏻‍♂ صاحب ربات",'callback_data'=>"sudohelpfa"]
	  ],
					 [
					 ['text'=>"🎉 کانال ما",'url'=>"https://telegram.me/$channel"],['text'=>"🔙 برگشت",'callback_data'=>'help']
					 ],
                     ]
               ])
           ]);
    }
			    elseif($data=="manageen"){
			 if ($statusq == 'creator' or $statusq == 'administrator' or in_array($fromid,$Dev)){
            Telegram('editmessagetext',[
                'chat_id'=>$chatid,
     'message_id'=>$messageid,
               'text'=>"📍 راهنمای دستورات مدیریتی :
➖➖➖➖➖

/panel
💭دریافت پنل تنظیمات و پنل مدیریت گروه

/settings
💭دریافت تنظیمات گروه به صورت متنی

/promote [ریپلای]
💭ادمین کرد فرد مورد نظر

/demote [ریپلای]
💭تنزل مقام فرد مورد نظر

/admin list 
💭دریافت لیست ادمین های گروه

/pin [ریپلای]
💭سنحاق کردن پیام مورد نظر توسط ربات

/unpin 
💭برداشتن پیام از حالت سنجاق

/kick [ریپلای | ایدی]
💭اخراج فرد مورد نظر از گروه

/del [ریپلای]
💭حذف پیام مورد نظر

/rmsg [1-300]
💭پاک کردن پیام های اخیر گروه

/setname [نام]
💭تنظیم نام گروه

/setdescription [متن]
💭تنظیم اطلاعات گروه

/delphoto 
💭حذف عکس گروه

/setphoto [ریپلای]
💭تنظیم عکس گروه

/automatic
💭فعال کردن قفل ها به صورت خودکار و مدیریت خود کار گروه

/mute all
💭ساکت کردن همه گروه

/unmute all
💭غیر فعال کردن سکوت گروه

/welcome [enable |disable]
💭روشن و خاموش کردن خوش امد

/setwelcome [متن]
💭تنظیم پیام خوش امد

/silent
💭افزودن فرد به لیست سکوت گروه

/silent [دقیقه]
💭افزودن فرد به لیست سکوت گروه به صورت زمان داره

/unsilent
💭خارج کردن فرد از لیست سکوت گروه

/list silent
💭دریافت لیست سکوت گروه

/clean silentlist
💭 پاک کردن لیست سکوت گروه

/request
💭درخواست تمدید شارژ برای گروه

/filter
💭افزودن کلمه به لیست کلمات فیلترشده

/unfilter
💭حذف کلمه از لیست کلمات فیلتر شده

/filterlist
💭دریافت لیست کلمات فیلتر شد

/clean filterlist
💭پاک کردن تمام کلمات درون لیست فیلتر

/restart settings
💭ریستارت کردن تنظیمات گروه به حالت اولیه

/add [on | off]
💭روشن و خاموش کردن اد اجباری در گروه

/setadd [عدد]
💭تنظیم مقدار کاربری که یک فرد باید دعوت کند تا بتواند در گروه چت کند

/setwarn [عدد]
💭 تنظیم حداکثر اخطار برای کاربر

/warn [ریپلای]
💭اخطار دادن به کاربر مورد نظر

/unwarn [ریپلای]
💭کم کردن اخطار های کاربر مورد نظر

/warn info [ریپلای]
💭به دست اوردن تعداد اخطار های کاربر

/setrules [متن]
💭تنظیم قوانین گروه

/muteall [دقیقه]
💭سکوت همه به صورت زمان دار

/channel [on | off]
💭روشن و خاموش کردن قفل کانال

/setchannel [@یوزرنیم کانال]
💭 قفل کردن ربات روی کانال تنظیم شد

/modebot [on | off]
💭 روشن و خاموش کردن حالت سختگیرانه اضافه کردن ربات

/modewarn [on | off]
💭 روشن و خاموش کردن حالت سختگیرانه اخراج کاربر پس از رسیدن به حداکثر اخطار

/delall
💭 پاکسازی پیام های اخیر گروه تا حد ممکن

➖➖➖
🔹برای دستورات انگلیسی ان هارو تایپ کنید و روی ان ها کلیک نکنید!

🔸در جای که علامت های [] وجود دارد در دستورات از ان ها استفاده نکنید

🔹میتوانید در متن خوش امد و قوانین برای گرفتن مشخصات از پارامتر های زیر استفاده کنید
gpname = دریافت نام گروه
username = دریافت یوزرنیم فرد
time = دریافت ساعت وتاریخ

✨مثال :
/setrules hi
➖➖➖",
               'reply_markup'=>json_encode([
                   'inline_keyboard'=>[
					 [
					 ['text'=>"🎉 کانال ما",'url'=>"https://telegram.me/$channel"],['text'=>"🔙 برگشت",'callback_data'=>'english']
					 ],
                     ]
               ])
           ]);
		   		 }else{
			Telegram('answerCallbackQuery',[
'callback_query_id'=>$membercall,
'text'=>"شما مدیر ربات نیستید ⚠️",
]);
    }
				}
				    elseif($data=="managefa"){
				 if ($statusq == 'creator' or $statusq == 'administrator' or in_array($fromid,$Dev) ){
            Telegram('editmessagetext',[
                'chat_id'=>$chatid,
     'message_id'=>$messageid,
               'text'=>"📍 راهنمای دستورات مدیریتی :
➖➖➖➖➖
🔸پنل
💭دریافت پنل تنظیمات و پنل مدیریت گروه

🔹تنظیمات
💭دریافت تنظیمات گروه به صورت متنی

🔸ترفیع [ریپلای]
💭ادمین کرد فرد مورد نظر

🔹تنزل [ریپلای]
💭تنزل مقام فرد مورد نظر

🔸لیست ادمین
💭دریافت لیست ادمین های گروه

🔹سنجاق [ریپلای]
💭سنحاق کردن پیام مورد نظر توسط ربات

🔸حذف سنجاق
💭حذف سنجاق پیام سنجاق شده

🔹اخراج فرد
💭اخراج فرد مورد نظر از گروه

🔸حذف [ریپلای]
💭حذف پیام مورد نظر

🔹پاک کردن [1-300]
💭پاک کردن پیام های اخیر گروه

🔸تنظیم نام [نام]
💭تنظیم نام گروه

🔹تنظیم اطلاعات [متن]
💭تنظیم اطلاعات گروه

🔸حذف عکس
💭حذف عکس گروه

🔹تنظیم عکس [ریپلای]
💭تنظیم عکس گروه

🔹اتوماتیک فعال
💭فعال کردن قفل ها به صورت خودکار و مدیریت خود کار گروه

🔸بیصدا همه
💭ساکت کردن همه گروه

🔹باصدا همه
💭غیر فعال کردن سکوت گروه

🔸خوش امد [روشن - خاموش]
💭روشن . خاموش کردن خوش امد گویی گروه

🔹تنظیم خوش امد [متن]
💭تنظیم پیام خوش امد

🔸بیصدا
💭افزودن فرد به لیست سکوت گروه

🔹بیصدا [دقیقه]
💭افزودن فرد به لیست سکوت گروه به صورت زمان داره

🔸باصدا
💭خارج کردن فرد از لیست سکوت گروه

🔹لیست سکوت
💭دریافت لیست سکوت گروه

🔸حذف لیست سکوت
💭 پاک کردن لیست سکوت گروه

🔹درخواست شارژ
💭درخواست تمدید شارژ برای گروه

🔸افزودن فیلتر [کلمه]
💭افزودن کلمه به لیست کلمات فیلترشده

🔹حذف فیلتر [کلمه]
💭حذف کلمه از لیست کلمات فیلتر شده

🔸لیست فیلتر
💭دریافت لیست کلمات فیلتر شد

🔹حذف لیست فیلتر
💭پاک کردن تمام کلمات درون لیست فیلتر

🔸ریستارت تنظیمات
💭ریستارت کردن تنظیمات گروه به حالت اولیه

🔹دعوت [روشن | خاموش]
💭روشن و خاموش کردن اد اجباری در گروه

🔸تنظیم دعوت [عدد]
💭تنظیم مقدار کاربری که یک فرد باید دعوت کند تا بتواند در گروه چت کند

🔹تنظیم اخطار [عدد]
💭 تنظیم حداکثر اخطار برای کاربر

🔸اخطار [ریپلای]
💭اخطار دادن به کاربر مورد نظر

🔹حذف اخطار [ریپلای]
💭کم کردن اخطار های کاربر مورد نظر

🔸اطلاعات اخطار [ریپلای]
💭به دست اوردن تعداد اخطار های کاربر

🔹تنظیم قوانین [متن]
💭تنظیم قوانین گروه

🔸بیصدا همه [دقیقه]
💭سکوت همه به صورت زمان دار

🔹قفل کانال [روشن | خاموش]
💭روشن و خاموش کردن قفل کانال

🔸تنظیم کانال [@یوزرنیم کانال]
💭 قفل کردن ربات روی کانال تنظیم شد

🔹سختگیرانه ربات [روشن | خاموش]
💭 روشن و خاموش کردن حالت سختگیرانه اضافه کردن ربات

🔸سختگیرانه اخطار [روشن | خاموش]
💭 روشن و خاموش کردن حالت سختگیرانه اخراج کاربر پس از رسیدن به حداکثر اخطار

🔹پاکسازی کلی
💭 پاکسازی پیام های اخیر گروه تا حد ممکن

➖➖➖
🔹ایموجی های ابتدای دستورات را وارد نکنید

🔸در جای که علامت های [] وجود دارد در دستورات از ان ها استفاده نکنید

🔹میتوانید در متن خوش امد و قوانین برای گرفتن نام و ایدی فرد از موارد زیر استفاده کنید
gpname = دریافت نام گروه
username = دریافت یوزرنیم طرف

✨مثال :
/setrules hi
➖➖➖",
               'reply_markup'=>json_encode([
                   'inline_keyboard'=>[
					 [
					 ['text'=>"🎉 کانال ما",'url'=>"https://telegram.me/$channel"],['text'=>"🔙 برگشت",'callback_data'=>'farsi']
					 ],
                     ]
               ])
           ]);
		   		 }else{
			Telegram('answerCallbackQuery',[
'callback_query_id'=>$membercall,
'text'=>"شما مدیر ربات نیستید ⚠️",
]);
    }
					}
					 elseif($data=="allen"){
            Telegram('editmessagetext',[
                'chat_id'=>$chatid,
     'message_id'=>$messageid,
               'text'=>"📍 راهنمای دستورات عمومی :
➖➖➖➖➖

/rules
💭دریافت قوانین گروه

/link
💭دریافت لینک گروه[باگ دارد!]

/time
💭دریافت تاریخ و ساعت

/id
💭دریافت اطلاعات خودتان

/id [ریپلای]
💭دریافت اطلاعات فرد

/me
💭دریافت اطلاعات شما به همراه مقام شما در ربات

/nerkh
💭دریافت نرخ برای خرید ربات

/info
💭دریافت اطلاعات گروه و خودتان

/ping
💭اطمینان حاصل کردن از انلاینی ربات

/logo [متن]
💭تبدیل متن شما به لوگو

/gif [متن]
💭تبدیل متن شما به گیف به صورت رندوم

/voice [متن]
💭تبدیل متن شما به صدا

/sticker [ریپلای]
💭تبدیل عکس شما به استیکر

/photo [ریپلای]
💭تبدیل استیکر شما به عکس

/support
💭در صورت وجود مشکل با ارسال این دستور پشتیبانی به گروه شما اعزام میشود

/report [ریپلای]
💭ارسال گزارش برای مدیر گروه

/kickme
💭اخراج شما از گروه

/azan
💭دریافت اوقات شرعی شهر تهران

/getpro [عدد]
💭دریافت عکس پروفایل شما به عدد

➖➖➖
🔹برای دستورات انگلیسی ان هارو تایپ کنید و روی ان ها کلیک نکنید!

🔸در جای که علامت های [] وجود دارد در دستورات از ان ها استفاده نکنید

🔅دستورات voice و gif و report به خاطر جلوگیری از اسپم معادل فارسی ندارند",
               'reply_markup'=>json_encode([
                   'inline_keyboard'=>[
					 [
					 ['text'=>"🎉 کانال ما",'url'=>"https://telegram.me/$channel"],['text'=>"🔙 برگشت",'callback_data'=>'english']
					 ],
                     ]
               ])
           ]);
    }
						 elseif($data=="allfa"){
            Telegram('editmessagetext',[
                'chat_id'=>$chatid,
     'message_id'=>$messageid,
               'text'=>"📍 راهنمای دستورات عمومی :
➖➖➖➖➖

🔸قوانین
💭دریافت قوانین گروه

🔹لینک
💭دریافت لینک گروه[باگ دارد!]

🔸ساعت
💭دریافت تاریخ و ساعت

🔹ایدی
💭دریافت اطلاعات خودتان

🔸ایدی [ریپلای]
💭دریافت اطلاعات فرد

🔹من
💭دریافت اطلاعات شما به همراه مقام شما در ربات

🔸نرخ
💭دریافت نرخ برای خرید ربات

🔹اطلاعات
💭دریافت اطلاعات گروه و خودتان

🔹انلاینی
💭اطمینان حاصل کردن از انلاینی ربات

🔸لوگو بساز [متن]
💭تبدیل متن شما به لوگو

/gif [متن]
💭تبدیل متن شما به گیف به صورت رندوم

/voice [متن]
💭تبدیل متن شما به صدا

🔹تبدیل به عکس
💭تبدیل عکس شما به استیکر

🔸تبدیل به استیکر
💭تبدیل استیکر شما به عکس

🔹درخواست پشتیبانی
💭در صورت وجود مشکل با ارسال این دستور پشتیبانی به گروه شما اعزام میشود

🔸/report [ریپلای]
💭ارسال گزارش برای مدیر گروه

🔹اخراج من
💭اخراج شما از گروه

🔸اذان
💭دریافت اوقات شرعی شهر تهران

🔹عکس پروفایل [عدد]
💭دریافت عکس پروفایل شما به عدد

➖➖➖
🔹ایموجی های ابتدای دستورات را وارد نکنید

🔸در جای که علامت های [] وجود دارد در دستورات از ان ها استفاده نکنید

🔅دستورات voice و gif و report به خاطر جلوگیری از اسپم معادل فارسی ندارند",
               'reply_markup'=>json_encode([
                   'inline_keyboard'=>[
					 [
					 ['text'=>"🎉 کانال ما",'url'=>"https://telegram.me/$channel"],['text'=>"🔙 برگشت",'callback_data'=>'farsi']
					 ],
                     ]
               ])
           ]);
    }	
				    elseif($data=="lockfa"){
				 if ($statusq == 'creator' or $statusq == 'administrator' or in_array($fromid,$Dev) ){
            Telegram('editmessagetext',[
                'chat_id'=>$chatid,
     'message_id'=>$messageid,
               'text'=>"📍 راهنمای دستورات قفلی :
➖➖➖
📌پاک کردن لینک 
🔹قفل لینک
🔸بازکردن لینک
〰〰〰
📌پاک کرد هشتگ
🔹قفل تگ
🔸بازکردن تگ
〰〰〰
📌پاک کردن یوزرنیم
🔹قفل یوزرنیم
🔸بازکردن یوزرنیم
〰〰〰
📌پاک کردن متن
🔹قفل متن
🔸بازکردن متن
〰〰〰
📌پاک کردن ویرایش پیام
🔹قفل ویرایش
🔸بازکردن ویرایش
〰〰〰
📌پاک کردن ربات های مخرب
🔹قفل ربات
🔸بازکردن ربات
〰〰〰
📌پاک کردن کلمات رکیک
🔹قفل فحش
🔸بازکردن فحش
〰〰〰
📌پاک کردن تصاویر متحرک
🔹قفل گیف
🔸بازکردن گیف
〰〰〰
📌پاک کردن عکس
🔹قفل عکس
🔸بازکردن عکس
〰〰〰
📌پاک کردن فیلم
🔹قفل ویدیو
🔸بازکردن ویدیو
〰〰〰
📌پاک کردن اهنگ
🔹قفل اهنگ
🔸بازکردن اهنگ
〰〰〰
📌پاک کردن ویس
🔹قفل ویس
🔸بازکردن ویس
〰〰〰
📌پاک کردن استیکر
🔹قفل استیکر
🔸بازکردن استیکر
〰〰〰
📌پاک کردن ارسال مخاطب
🔹قفل مخاطب
🔸بازکردن مخاطب
〰〰〰
📌پاک کردن فوروارد
🔹قفل فوروارد
🔸بازکردن فوروارد
〰〰〰
📌پاک کردن ارسال مکان
🔹قفل مکان
🔸بازکردن مکان
〰〰〰
📌پاک کردن ارسال فایل
🔹قفل فایل
🔸بازکردن فایل
〰〰〰
📌پاک کردن بازی تحت وب
🔹قفل بازی
🔸بازکردن بازی
〰〰〰
📌پاک کردن پیام ویدیویی
🔹قفل پیام ویدیویی
🔸بازکردن پیام ویدیویی
〰〰〰
📌پاک کردن ریپلای کردن پیام
🔹قفل ریپلای
🔸بازکردن ریپلای
〰〰〰
📌جلو گیری از دستورات عمومی
🔹قفل دستورات
🔸بازکردن دستورات
〰〰〰
📌قفل خدمات تلگرام
🔹قفل خدمات
🔸بازکردن خدمات
〰〰〰
📌خاموش و روشن کردن قفل خودکار گروه
🔹قفل خودکار روشن
🔸قفل خودکار خاموش
❄️تنظیم قفل خودکار [زمان پایان زمان شروع] 
📍 زمان را باید با فرمت صحیح استفاده کنید مثال :
تنظیم قفل خودکار 13:36 19:05
〰〰〰
📌خاموش و روشن کردن و تنظیم کاراکتر پیام
🔹قفل کاراکتر
🔸بازکردن کاراکتر
❄️تنظیم کاراکتر [حداقل کاراکتر حداکثر کاراکتر]
📍 باید حتما به عدد وارد کنید مثال :
تنظیم کاراکتر 10 320

➖➖➖
🔹ایموجی های ابتدای دستورات را وارد نکنید

🔖بازکردن و قفل کردن هم از طریق پنل و هم از طریق دستور ممکن است

🔸مثال :
قفل لینک
بازکردن لینک
➖➖➖",
               'reply_markup'=>json_encode([
                   'inline_keyboard'=>[
					 [
					 ['text'=>"🎉 کانال ما",'url'=>"https://telegram.me/$channel"],['text'=>"🔙 برگشت",'callback_data'=>'farsi']
					 ],
                     ]
               ])
           ]);
		   		 }else{
			Telegram('answerCallbackQuery',[
'callback_query_id'=>$membercall,
'text'=>"شما مدیر ربات نیستید ⚠️",
]);
    }
					}	
									    elseif($data=="locken"){
				 if ($statusq == 'creator' or $statusq == 'administrator' or in_array($fromid,$Dev) ){
            Telegram('editmessagetext',[
                'chat_id'=>$chatid,
     'message_id'=>$messageid,
               'text'=>"📍 راهنمای دستورات قفلی :
➖➖➖➖➖

📌پاک کردن لینک 
/lock link
/unlock link
〰〰〰
📌پاک کرد هشتگ
/lock tag
/unlock tag
〰〰〰
📌پاک کردن یوزرنیم
/lock username
/unlock username
〰〰〰
📌پاک کردن متن
/lock text
/unlock text
〰〰〰
📌پاک کردن ویرایش پیام
/lock edit
/unlock edit
〰〰〰
📌پاک کردن ربات های مخرب
/lock bots
/unlock bots
〰〰〰
📌پاک کردن کلمات رکیک
/lock fosh
/unlock fosh
〰〰〰
📌پاک کردن تصاویر متحرک
/lock gif
/unlock gif
〰〰〰
📌پاک کردن عکس
/lock photo
/unlock photo
〰〰〰
📌پاک کردن فیلم
/lock video
/unlock video
〰〰〰
📌پاک کردن اهنگ
/lock audio
/unlock audio
〰〰〰
📌پاک کردن ویس
/lock voice
/unlock voice
〰〰〰
📌پاک کردن استیکر
/lock sticker
/unlock sticker
〰〰〰
📌پاک کردن ارسال مخاطب
/lock contact
/unlock contact
〰〰〰
📌پاک کردن فوروارد
/lock forward
/unlock forward
〰〰〰
📌پاک کردن ارسال مکان
/lock location
/unlock location
〰〰〰
📌پاک کردن ارسال فایل
/lock document
/unlock document
〰〰〰
📌پاک کردن بازی تحت وب
/lock game
/unlock game
〰〰〰
📌پاک کردن پیام ویدیویی
/lock videonote
/unlock videonote
〰〰〰
📌پاک کردن ریپلای کردن پیام
/lock reply
/unlock reply
〰〰〰
📌جلو گیری از دستورات عمومی
/lock cmd
/unlock cmd
〰〰〰
📌قفل خدمات تلگرام
/lock tgservic
/unlock tgservic
〰〰〰
📌خاموش و روشن کردن قفل خودکار گروه
/lock auto
/unlock auto
/setlockauto [زمان پایان زمان شروع]
📍 زمان را باید با فرمت صحیح استفاده کنید مثال :
/setlockauto 13:36 19:05
〰〰〰
📌خاموش و روشن کردن و تنظیم کاراکتر پیام
/lock character
/unlock character
/setlockcharacter [حداقل کاراکتر حداکثر کاراکتر]
📍 باید حتما به عدد وارد کنید مثال :
/setlockcharacter 10 320

➖➖➖
🔹برای دستورات انگلیسی ان هارو تایپ کنید و روی ان ها کلیک نکنید!

🔖بازکردن و قفل کردن هم از طریق پنل و هم از طریق دستور ممکن است

🔸مثال :
/lock link
/unlock link
➖➖➖",
               'reply_markup'=>json_encode([
                   'inline_keyboard'=>[
					 [
					 ['text'=>"🎉 کانال ما",'url'=>"https://telegram.me/$channel"],['text'=>"🔙 برگشت",'callback_data'=>'english']
					 ],
                     ]
               ])
           ]);
		   		 }else{
			Telegram('answerCallbackQuery',[
'callback_query_id'=>$membercall,
'text'=>"شما مدیر ربات نیستید ⚠️",
]);
    }
					}
						 elseif($data=="sudohelpfa"){
				 if (in_array($fromid,$Dev) ){
            Telegram('editmessagetext',[
                'chat_id'=>$chatid,
     'message_id'=>$messageid,
               'text'=>"📍 راهنمای دستورات سودو :
➖➖➖➖➖

🔸پنل مدیریت
💭دریافت پنل مدیریت ربات و ارسال پیام به گروه ها و ممبر ها

🔹مدیریت گروه ها
💭دریافت پنل مدیریت گروه های ربات

🔸ترک
💭خروج ربات از گروه

🔹حذف
💭حدف گروه از لیست گروه های پشتیبانی

🔸نصب
💭اضافه کردن گروه به لیست گروه های پشتیبانی

🔹تنظیم شارژ
💭تنظیم شارژ برای گروه مورد نظر

🔸ارسال شارژ [ایدی گروه]
💭فعال سازی شارژ برای گروه مورد نظر به مدت 30 روز

🔹ترک [ایدی گروه]
💭ترک ربات از گروه مورد نظر

🔸 مسدود همگانی [ایدی]
💭 مسدود کردن فرد هم از پیوی و هم از تمام گروه های ربات

🔹 ازاد همگانی [ایدی]
💭 خارج کردن فرد از لیست مسدودت همگانی

🔸 لیست مسدود همگانی
💭 مشاهده لیست مسدود همگانی ربات

➖➖➖
🔹ایموجی های ابتدای دستورات را وارد نکنید",
               'reply_markup'=>json_encode([
                   'inline_keyboard'=>[
					 [
					 ['text'=>"🎉 کانال ما",'url'=>"https://telegram.me/$channel"],['text'=>"🔙 برگشت",'callback_data'=>'farsi']
					 ],
                     ]
               ])
           ]);
		   		 }else{
			Telegram('answerCallbackQuery',[
'callback_query_id'=>$membercall,
'text'=>"شما ادمین ربات نیستید ⚠️",
]);
    }
					}
							elseif($data=="sudohelpen"){
				 if (in_array($fromid,$Dev) ){
            Telegram('editmessagetext',[
                'chat_id'=>$chatid,
     'message_id'=>$messageid,
               'text'=>"📍 راهنمای دستورات سودو :
➖➖➖➖➖

/panel admin
💭دریافت پنل مدیریت ربات و ارسال پیام به گروه ها و ممبر ها

/panel group
💭دریافت پنل مدیریت گروه های ربات

/leave
💭خروج ربات از گروه

/rem
💭حدف گروه از لیست گروه های پشتیبانی

/add
💭اضافه کردن گروه به لیست گروه های پشتیبانی

/charge
💭تنظیم شارژ برای گروه مورد نظر

/sendcharge [ایدی گروه]
💭فعال سازی شارژ برای گروه مورد نظر به مدت 30 روز

/left [ایدی گروه]
💭ترک ربات از گروه مورد نظر

/banall [ایدی]
💭 مسدود کردن فرد هم از پیوی و هم از تمام گروه های ربات

/unbanall [ایدی]
💭 خارج کردن فرد از لیست مسدودت همگانی

/banlist
💭 مشاهده لیست مسدود همگانی ربات

➖➖➖
🔹برای دستورات انگلیسی ان هارو تایپ کنید و روی ان ها کلیک نکنید!

➖➖➖",
               'reply_markup'=>json_encode([
                   'inline_keyboard'=>[
					 [
					 ['text'=>"🎉 کانال ما",'url'=>"https://telegram.me/$channel"],['text'=>"🔙 برگشت",'callback_data'=>'english']
					 ],
                     ]
               ])
           ]);
		   		 }else{
			Telegram('answerCallbackQuery',[
'callback_query_id'=>$membercall,
'text'=>"شما ادمین ربات نیستید ⚠️",
]);
    }
					}
  elseif($data=="helppanel"){
									 if ($statusq == 'creator' or $statusq == 'administrator' or in_array($fromid,$Dev) ){
            Telegram('editmessagetext',[
                'chat_id'=>$chatid,
     'message_id'=>$messageid,
               'text'=>"🚩به راهنمای ربات مدیریت گروه خوش امدید
➖➖➖➖➖➖➖➖
🔖لطفا زبان مورد نظر برای دستورات را انتخاب کنید

💥در راهنما به نکات زیر توجه کنید

🔹🔸🔹🔸🔹🔸🔹🔸🔹🔸🔹

🔹برای دستورات انگلیسی ان هارو تایپ کنید و روی ان ها کلیک نکنید!

🔸در جای که علامت های [] وجود دارد در دستورات از ان ها استفاده نکنید
➖➖➖",
	   'reply_markup'=>json_encode([
    'inline_keyboard'=>[
 	[
	  ['text'=>"🇮🇷 فارسی",'callback_data'=>"farsipanel"],['text'=>"🇬🇧 انگلیسی",'callback_data'=>"englishpanel"]
	  ],
	  	  	 [
				 ['text'=>"🎉 کانال ما",'url'=>"https://telegram.me/$channel"],['text'=>"🔙 برگشت",'callback_data'=>'back']
		 ],
		      [
   ['text'=>"✖️ خروج",'callback_data'=>'exit']
   ],
   ]
   ])
   ]);
   }else{
			Telegram('answerCallbackQuery',[
'callback_query_id'=>$membercall,
'text'=>"شما مدیر ربات نیستید ⚠️",
]);
   } 
						}
   	    elseif($data=="englishpanel"){
					 if ($statusq == 'creator' or $statusq == 'administrator' or in_array($fromid,$Dev) ){
            Telegram('editmessagetext',[
                'chat_id'=>$chatid,
     'message_id'=>$messageid,
               'text'=>"به بخش دریافت دستورات انگلیسی خوش امدید❤️
➖➖➖➖➖➖➖➖
🔖لطفا بخش مورد نظر خورد را انتخاب کنید

➖➖➖➖

⚠️به نکات زیر توجه کنید :

🔹برای دیدن دستورات قفلی و مدیریتی شما باید حتما مدیر ربات باشید و کابران عادی اجازه ورود به این بخش را ندارند

💥دستورات عمومی برای همه کاربران است و همه اجازه استفاده از این دستورات را دارند

🎉دستورات صاحب ربات فقط برای سودو ربات هست و دیگر کاربران  اجازه ورود ندارند
➖➖➖",
               'reply_markup'=>json_encode([
                   'inline_keyboard'=>[
				    	[
	  ['text'=>"🚦 عمومی",'callback_data'=>"allenpanel"],['text'=>"🔖 مدیریتی",'callback_data'=>"manageenpanel"]
	  ],
	  				    	[
	  ['text'=>"🔐 قفل ها",'callback_data'=>"lockenpanel"],['text'=>"🤦🏻‍♂ صاحب ربات",'callback_data'=>"sudohelpenpanel"]
	  ],
					 [
					 ['text'=>"🎉 کانال ما",'url'=>"https://telegram.me/$channel"],['text'=>"🔙 برگشت",'callback_data'=>'helppanel']
					 ],
                     ]
               ])
           ]);
		   }else{
			Telegram('answerCallbackQuery',[
'callback_query_id'=>$membercall,
'text'=>"شما مدیر ربات نیستید ⚠️",
]);
    }
		}
		    elseif($data=="farsipanel"){
						 if ($statusq == 'creator' or $statusq == 'administrator' or in_array($fromid,$Dev) ){
            Telegram('editmessagetext',[
                'chat_id'=>$chatid,
     'message_id'=>$messageid,
               'text'=>"به بخش دریافت دستورات فارسی خوش امدید❤️
➖➖➖➖➖➖➖➖
🔖لطفا بخش مورد نظر خورد را انتخاب کنید

➖➖➖➖

⚠️به نکات زیر توجه کنید :

🔹برای دیدن دستورات قفلی و مدیریتی شما باید حتما مدیر ربات باشید و کابران عادی اجازه ورود به این بخش را ندارند

💥دستورات عمومی برای همه کاربران است و همه اجازه استفاده از این دستورات را دارند

🎉دستورات صاحب ربات فقط برای سودو ربات هست و دیگر کاربران  اجازه ورود ندارند
➖➖➖",
               'reply_markup'=>json_encode([
                   'inline_keyboard'=>[
				    	[
	  ['text'=>"🚦 عمومی",'callback_data'=>"allfapanel"],['text'=>"🔖 مدیریتی",'callback_data'=>"managefapanel"]
	  ],
	  				    	[
	  ['text'=>"🔐 قفل ها",'callback_data'=>"lockfapanel"],['text'=>"🤦🏻‍♂ صاحب ربات",'callback_data'=>"sudohelpfapanel"]
	  ],
					 [
					 ['text'=>"🎉 کانال ما",'url'=>"https://telegram.me/$channel"],['text'=>"🔙 برگشت",'callback_data'=>'helppanel']
					 ],
                     ]
               ])
           ]);
		   }else{
			Telegram('answerCallbackQuery',[
'callback_query_id'=>$membercall,
'text'=>"شما مدیر ربات نیستید ⚠️",
]);
    }
			}
			elseif($data=="manageenpanel"){
			 if ($statusq == 'creator' or $statusq == 'administrator' or in_array($fromid,$Dev) ){
            Telegram('editmessagetext',[
                'chat_id'=>$chatid,
     'message_id'=>$messageid,
               'text'=>"📍 راهنمای دستورات مدیریتی :
➖➖➖➖➖

/panel
💭دریافت پنل تنظیمات و پنل مدیریت گروه

/settings
💭دریافت تنظیمات گروه به صورت متنی

/promote [ریپلای]
💭ادمین کرد فرد مورد نظر

/demote [ریپلای]
💭تنزل مقام فرد مورد نظر

/admin list 
💭دریافت لیست ادمین های گروه

/pin [ریپلای]
💭سنحاق کردن پیام مورد نظر توسط ربات

/unpin 
💭برداشتن پیام از حالت سنجاق

/kick [ریپلای | ایدی]
💭اخراج فرد مورد نظر از گروه

/del [ریپلای]
💭حذف پیام مورد نظر

/rmsg [1-300]
💭پاک کردن پیام های اخیر گروه

/setname [نام]
💭تنظیم نام گروه

/setdescription [متن]
💭تنظیم اطلاعات گروه

/delphoto 
💭حذف عکس گروه

/setphoto [ریپلای]
💭تنظیم عکس گروه

/automatic
💭فعال کردن قفل ها به صورت خودکار و مدیریت خود کار گروه

/mute all
💭ساکت کردن همه گروه

/unmute all
💭غیر فعال کردن سکوت گروه

/welcome [enable |disable]
💭روشن و خاموش کردن خوش امد

/setwelcome [متن]
💭تنظیم پیام خوش امد

/silent
💭افزودن فرد به لیست سکوت گروه

/silent [دقیقه]
💭افزودن فرد به لیست سکوت گروه به صورت زمان داره

/unsilent
💭خارج کردن فرد از لیست سکوت گروه

/list silent
💭دریافت لیست سکوت گروه

/clean silentlist
💭 پاک کردن لیست سکوت گروه

/request
💭درخواست تمدید شارژ برای گروه

/filter
💭افزودن کلمه به لیست کلمات فیلترشده

/unfilter
💭حذف کلمه از لیست کلمات فیلتر شده

/filterlist
💭دریافت لیست کلمات فیلتر شد

/clean filterlist
💭پاک کردن تمام کلمات درون لیست فیلتر

/restart settings
💭ریستارت کردن تنظیمات گروه به حالت اولیه

/add [on | off]
💭روشن و خاموش کردن اد اجباری در گروه

/setadd [عدد]
💭تنظیم مقدار کاربری که یک فرد باید دعوت کند تا بتواند در گروه چت کند

/setwarn [عدد]
💭 تنظیم حداکثر اخطار برای کاربر

/warn [ریپلای]
💭اخطار دادن به کاربر مورد نظر

/unwarn [ریپلای]
💭کم کردن اخطار های کاربر مورد نظر

/warn info [ریپلای]
💭به دست اوردن تعداد اخطار های کاربر

/setrules [متن]
💭تنظیم قوانین گروه

/muteall [دقیقه]
💭سکوت همه به صورت زمان دار

/channel [on | off]
💭روشن و خاموش کردن قفل کانال

/setchannel [@یوزرنیم کانال]
💭 قفل کردن ربات روی کانال تنظیم شد

/modebot [on | off]
💭 روشن و خاموش کردن حالت سختگیرانه اضافه کردن ربات

/modewarn [on | off]
💭 روشن و خاموش کردن حالت سختگیرانه اخراج کاربر پس از رسیدن به حداکثر اخطار

/delall
💭 پاکسازی پیام های اخیر گروه تا حد ممکن

➖➖➖
🔹برای دستورات انگلیسی ان هارو تایپ کنید و روی ان ها کلیک نکنید!

🔸در جای که علامت های [] وجود دارد در دستورات از ان ها استفاده نکنید

🔹میتوانید در متن خوش امد و قوانین برای گرفتن نام و ایدی فرد از موارد زیر استفاده کنید
gpname = دریافت نام گروه
username = دریافت یوزرنیم طرف

✨مثال :
/setrules hi
➖➖➖",
               'reply_markup'=>json_encode([
                   'inline_keyboard'=>[
					 [
					 ['text'=>"🎉 کانال ما",'url'=>"https://telegram.me/$channel"],['text'=>"🔙 برگشت",'callback_data'=>'englishpanel']
					 ],
                     ]
               ])
           ]);
		   }else{
			Telegram('answerCallbackQuery',[
'callback_query_id'=>$membercall,
'text'=>"شما مدیر ربات نیستید ⚠️",
]);
    }
				}
				    elseif($data=="managefapanel"){
				 if ($statusq == 'creator' or $statusq == 'administrator' or in_array($fromid,$Dev) ){
            Telegram('editmessagetext',[
                'chat_id'=>$chatid,
     'message_id'=>$messageid,
               'text'=>"📍 راهنمای دستورات مدیریتی :
➖➖➖➖➖
🔹پنل
💭دریافت پنل تنظیمات و پنل مدیریت گروه

🔸تنظیمات
💭دریافت تنظیمات گروه به صورت متنی

🔹ترفیع [ریپلای]
💭ادمین کرد فرد مورد نظر

🔸تنزل [ریپلای]
💭تنزل مقام فرد مورد نظر

🔹لیست ادمین [ریپلای]
💭دریافت لیست ادمین های گروه

🔸سنجاق [ریپلای]
💭سنحاق کردن پیام مورد نظر توسط ربات

🔹حذف سنجاق
💭حذف سنجاق پیام سنجاق شده

🔸پاک کردن [1-300]
💭پاک کردن پیام های اخیر گروه

🔹تنظیم نام [نام]
💭تنظیم نام گروه

🔸تنظیم اطلاعات [متن]
💭تنظیم اطلاعات گروه

🔹حذف عکس
💭حذف عکس گروه

🔸تنظیم عکس
💭تنظیم عکس گروه

🔸اتوماتیک فعال
💭فعال کردن قفل ها به صورت خودکار و مدیریت خود کار گروه

🔹بیصدا همه
💭ساکت کردن همه گروه

🔸باصدا همه
💭غیر فعال کردن سکوت گروه

🔹خوش امد روشن
💭روشن کردن خوش امد

🔸خوش امد خاموش
💭خاموش کردن خوش امد

🔹تنظیم خوش امد [متن]
💭تنظیم پیام خوش امد

🔸بیصدا
💭افزودن فرد به لیست سکوت گروه

🔹بیصدا [دقیقه]
💭افزودن فرد به لیست سکوت گروه به صورت زمان داره

🔸باصدا
💭خارج کردن فرد از لیست سکوت گروه

🔹لیست سکوت
💭دریافت لیست سکوت گروه

🔸حذف لیست سکوت
💭 پاک کردن لیست سکوت گروه

🔹درخواست شارژ
💭درخواست تمدید شارژ برای گروه

🔸افزودن فیلتر [کلمه]
💭افزودن کلمه به لیست کلمات فیلترشده

🔹حذف فیلتر [کلمه]
💭حذف کلمه از لیست کلمات فیلتر شده

🔸فیلتر لیست
💭دریافت لیست کلمات فیلتر شد

🔹حذف لیست فیلتر
💭پاک کردن تمام کلمات درون لیست فیلتر

🔸ریستارت تنظیمات
💭ریستارت کردن تنظیمات گروه به حالت اولیه

🔹ادد [روشن | خاموش]
💭روشن و خاموش کردن اد اجباری در گروه

🔸تنظیم دعوت [عدد]
💭تنظیم مقدار کاربری که یک فرد باید دعوت کند تا بتواند در گروه چت کند

🔸تنظیم اخطار [عدد]
💭 تنظیم حداکثر اخطار برای کاربر

🔹اخطار [ریپلای]
💭اخطار دادن به کاربر مورد نظر

🔸حذف اخطار [ریپلای]
💭کم کردن اخطار های کاربر مورد نظر

🔹اطلاعات اخطار [ریپلای]
💭به دست اوردن تعداد اخطار های کاربر

🔸تنظیم قوانین [متن]
💭تنظیم قوانین گروه

🔹بیصدا همه [دقیقه]
💭سکوت همه به صورت زمان دار

🔸قفل کانال [روشن | خاموش]
💭روشن و خاموش کردن قفل کانال

🔹تنظیم کانال [@یوزرنیم کانال]
💭 قفل کردن ربات روی کانال تنظیم شد

🔸سختگیرانه ربات [روشن | خاموش]
💭 روشن و خاموش کردن حالت سختگیرانه اضافه کردن ربات

🔹سختگیرانه اخطار [روشن | خاموش]
💭 روشن و خاموش کردن حالت سختگیرانه اخراج کاربر پس از رسیدن به حداکثر اخطار

🔸 پاکسازی کلی
💭 پاکسازی پیام های اخیر گروه تا حد ممکن

➖➖➖
🔹ایموجی های ابتدای دستورات را وارد نکنید

🔸در جای که علامت های [] وجود دارد در دستورات از ان ها استفاده نکنید

🔹میتوانید در متن خوش امد و قوانین برای گرفتن مشخصات از پارامتر های زیر استفاده کنید
gpname = دریافت نام گروه
username = دریافت یوزرنیم فرد
time = دریافت ساعت وتاریخ

✨مثال :
/setrules hi
➖➖➖",
               'reply_markup'=>json_encode([
                   'inline_keyboard'=>[
					 [
					 ['text'=>"🎉 کانال ما",'url'=>"https://telegram.me/$channel"],['text'=>"🔙 برگشت",'callback_data'=>'farsipanel']
					 ],
                     ]
               ])
           ]);
		   }else{
			Telegram('answerCallbackQuery',[
'callback_query_id'=>$membercall,
'text'=>"شما مدیر ربات نیستید ⚠️",
]);
    }
					}
					 elseif($data=="allenpanel"){
						 	 if ($statusq == 'creator' or $statusq == 'administrator' or in_array($fromid,$Dev) ){
            Telegram('editmessagetext',[
                'chat_id'=>$chatid,
     'message_id'=>$messageid,
               'text'=>"📍 راهنمای دستورات عمومی :
➖➖➖➖➖

/rules
💭دریافت قوانین گروه

/link
💭دریافت لینک گروه[باگ دارد!]

/time
💭دریافت تاریخ و ساعت

/id
💭دریافت اطلاعات خودتان

/id [ریپلای]
💭دریافت اطلاعات فرد

/me
💭دریافت اطلاعات شما به همراه مقام شما در ربات

/nerkh
💭دریافت نرخ برای خرید ربات

/info
💭دریافت اطلاعات گروه و خودتان

/ping
💭اطمینان حاصل کردن از انلاینی ربات

/logo [متن]
💭تبدیل متن شما به لوگو

/gif [متن]
💭تبدیل متن شما به گیف به صورت رندوم

/voice [متن]
💭تبدیل متن شما به صدا

/sticker [ریپلای]
💭تبدیل عکس شما به استیکر

/photo [ریپلای]
💭تبدیل استیکر شما به عکس

/support
💭در صورت وجود مشکل با ارسال این دستور پشتیبانی به گروه شما اعزام میشود

/report [ریپلای]
💭ارسال گزارش برای مدیر گروه

/kickme
💭اخراج شما از گروه

/azan
💭دریافت اوقات شرعی شهر تهران

/getpro [عدد]
💭دریافت عکس پروفایل شما به عدد

➖➖➖
🔹برای دستورات انگلیسی ان هارو تایپ کنید و روی ان ها کلیک نکنید!

🔸در جای که علامت های [] وجود دارد در دستورات از ان ها استفاده نکنید

🔅دستورات voice و gif و report به خاطر جلوگیری از اسپم معادل فارسی ندارند",
               'reply_markup'=>json_encode([
                   'inline_keyboard'=>[
					 [
					 ['text'=>"🎉 کانال ما",'url'=>"https://telegram.me/$channel"],['text'=>"🔙 برگشت",'callback_data'=>'englishpanel']
					 ],
                     ]
               ])
           ]);
		   }else{
			Telegram('answerCallbackQuery',[
'callback_query_id'=>$membercall,
'text'=>"شما مدیر ربات نیستید ⚠️",
]);
    }
					 }
						 elseif($data=="allfapanel"){
							 	 if ($statusq == 'creator' or $statusq == 'administrator' or in_array($fromid,$Dev) ){
            Telegram('editmessagetext',[
                'chat_id'=>$chatid,
     'message_id'=>$messageid,
               'text'=>"📍 راهنمای دستورات عمومی :
➖➖➖➖➖

🔸قوانین
💭دریافت قوانین گروه

🔹لینک
💭دریافت لینک گروه[باگ دارد!]

🔸ساعت
💭دریافت تاریخ و ساعت

🔹ایدی
💭دریافت اطلاعات خودتان

🔸ایدی [ریپلای]
💭دریافت اطلاعات فرد

🔹من
💭دریافت اطلاعات شما به همراه مقام شما در ربات

🔸نرخ
💭دریافت نرخ برای خرید ربات

🔹اطلاعات
💭دریافت اطلاعات گروه و خودتان

🔹انلاینی
💭اطمینان حاصل کردن از انلاینی ربات

🔸لوگو بساز [متن]
💭تبدیل متن شما به لوگو

/gif [متن]
💭تبدیل متن شما به گیف به صورت رندوم

/voice [متن]
💭تبدیل متن شما به صدا

🔹تبدیل به عکس
💭تبدیل عکس شما به استیکر

🔸تبدیل به استیکر
💭تبدیل استیکر شما به عکس

🔹درخواست پشتیبانی
💭در صورت وجود مشکل با ارسال این دستور پشتیبانی به گروه شما اعزام میشود

🔸/report [ریپلای]
💭ارسال گزارش برای مدیر گروه

🔹اخراج من
💭اخراج شما از گروه

🔸اذان
💭دریافت اوقات شرعی شهر تهران

🔹عکس پروفایل [عدد]
💭دریافت عکس پروفایل شما به عدد

➖➖➖
🔹ایموجی های ابتدای دستورات را وارد نکنید

🔸در جای که علامت های [] وجود دارد در دستورات از ان ها استفاده نکنید

🔅دستورات voice و gif و report به خاطر جلوگیری از اسپم معادل فارسی ندارند",
               'reply_markup'=>json_encode([
                   'inline_keyboard'=>[
					 [
					 ['text'=>"🎉 کانال ما",'url'=>"https://telegram.me/$channel"],['text'=>"🔙 برگشت",'callback_data'=>'farsipanel']
					 ],
                     ]
               ])
           ]);
		   }else{
			Telegram('answerCallbackQuery',[
'callback_query_id'=>$membercall,
'text'=>"شما مدیر ربات نیستید ⚠️",
]);
    }	
						 }
				    elseif($data=="lockfapanel"){
				 if ($statusq == 'creator' or $statusq == 'administrator' or in_array($fromid,$Dev) ){
            Telegram('editmessagetext',[
                'chat_id'=>$chatid,
     'message_id'=>$messageid,
               'text'=>"📍 راهنمای دستورات قفلی :
➖➖➖
📌پاک کردن لینک 
🔹قفل لینک
🔸بازکردن لینک
〰〰〰
📌پاک کرد هشتگ
🔹قفل تگ
🔸بازکردن تگ
〰〰〰
📌پاک کردن یوزرنیم
🔹قفل یوزرنیم
🔸بازکردن یوزرنیم
〰〰〰
📌پاک کردن متن
🔹قفل متن
🔸بازکردن متن
〰〰〰
📌پاک کردن ویرایش پیام
🔹قفل ویرایش
🔸بازکردن ویرایش
〰〰〰
📌پاک کردن ربات های مخرب
🔹قفل ربات
🔸بازکردن ربات
〰〰〰
📌پاک کردن کلمات رکیک
🔹قفل فحش
🔸بازکردن فحش
〰〰〰
📌پاک کردن تصاویر متحرک
🔹قفل گیف
🔸بازکردن گیف
〰〰〰
📌پاک کردن عکس
🔹قفل عکس
🔸بازکردن عکس
〰〰〰
📌پاک کردن فیلم
🔹قفل ویدیو
🔸بازکردن ویدیو
〰〰〰
📌پاک کردن اهنگ
🔹قفل اهنگ
🔸بازکردن اهنگ
〰〰〰
📌پاک کردن ویس
🔹قفل ویس
🔸بازکردن ویس
〰〰〰
📌پاک کردن استیکر
🔹قفل استیکر
🔸بازکردن استیکر
〰〰〰
📌پاک کردن ارسال مخاطب
🔹قفل مخاطب
🔸بازکردن مخاطب
〰〰〰
📌پاک کردن فوروارد
🔹قفل فوروارد
🔸بازکردن فوروارد
〰〰〰
📌پاک کردن ارسال مکان
🔹قفل مکان
🔸بازکردن مکان
〰〰〰
📌پاک کردن ارسال فایل
🔹قفل فایل
🔸بازکردن فایل
〰〰〰
📌پاک کردن بازی تحت وب
🔹قفل بازی
🔸بازکردن بازی
〰〰〰
📌پاک کردن پیام ویدیویی
🔹قفل پیام ویدیویی
🔸بازکردن پیام ویدیویی
〰〰〰
📌پاک کردن ریپلای کردن پیام
🔹قفل ریپلای
🔸بازکردن ریپلای
〰〰〰
📌جلو گیری از دستورات عمومی
🔹قفل دستورات
🔸بازکردن دستورات
〰〰〰
📌قفل خدمات تلگرام
🔹قفل خدمات
🔸بازکردن خدمات
〰〰〰
📌خاموش و روشن کردن قفل خودکار گروه
🔹قفل خودکار روشن
🔸قفل خودکار خاموش
❄️تنظیم قفل خودکار [زمان پایان زمان شروع] 
📍 زمان را باید با فرمت صحیح استفاده کنید مثال :
تنظیم قفل خودکار 13:36 19:05
〰〰〰
📌خاموش و روشن کردن و تنظیم کاراکتر پیام
🔹قفل کاراکتر
🔸بازکردن کاراکتر
❄️تنظیم کاراکتر [حداقل کاراکتر حداکثر کاراکتر]
📍 باید حتما به عدد وارد کنید مثال :
تنظیم کاراکتر 10 320

➖➖➖
🔹ایموجی های ابتدای دستورات را وارد نکنید

🔖بازکردن و قفل کردن هم از طریق پنل و هم از طریق دستور ممکن است

🔸مثال :
قفل لینک
بازکردن لینک
➖➖➖",
               'reply_markup'=>json_encode([
                   'inline_keyboard'=>[
					 [
					 ['text'=>"🎉 کانال ما",'url'=>"https://telegram.me/$channel"],['text'=>"🔙 برگشت",'callback_data'=>'farsipanel']
					 ],
                     ]
               ])
           ]);
		   }else{
			Telegram('answerCallbackQuery',[
'callback_query_id'=>$membercall,
'text'=>"شما مدیر ربات نیستید ⚠️",
]);
    }
					}	
									    elseif($data=="lockenpanel"){
				 if ($statusq == 'creator' or $statusq == 'administrator' or in_array($fromid,$Dev) ){
            Telegram('editmessagetext',[
                'chat_id'=>$chatid,
     'message_id'=>$messageid,
               'text'=>"📍 راهنمای دستورات قفلی :
➖➖➖➖➖

📌پاک کردن لینک 
/lock link
/unlock link
〰〰〰
📌پاک کرد هشتگ
/lock tag
/unlock tag
〰〰〰
📌پاک کردن یوزرنیم
/lock username
/unlock username
〰〰〰
📌پاک کردن متن
/lock text
/unlock text
〰〰〰
📌پاک کردن ویرایش پیام
/lock edit
/unlock edit
〰〰〰
📌پاک کردن ربات های مخرب
/lock bots
/unlock bots
〰〰〰
📌پاک کردن کلمات رکیک
/lock fosh
/unlock fosh
〰〰〰
📌پاک کردن تصاویر متحرک
/lock gif
/unlock gif
〰〰〰
📌پاک کردن عکس
/lock photo
/unlock photo
〰〰〰
📌پاک کردن فیلم
/lock video
/unlock video
〰〰〰
📌پاک کردن اهنگ
/lock audio
/unlock audio
〰〰〰
📌پاک کردن ویس
/lock voice
/unlock voice
〰〰〰
📌پاک کردن استیکر
/lock sticker
/unlock sticker
〰〰〰
📌پاک کردن ارسال مخاطب
/lock contact
/unlock contact
〰〰〰
📌پاک کردن فوروارد
/lock forward
/unlock forward
〰〰〰
📌پاک کردن ارسال مکان
/lock location
/unlock location
〰〰〰
📌پاک کردن ارسال فایل
/lock document
/unlock document
〰〰〰
📌پاک کردن بازی تحت وب
/lock game
/unlock game
〰〰〰
📌پاک کردن پیام ویدیویی
/lock videonote
/unlock videonote
〰〰〰
📌پاک کردن ریپلای کردن پیام
/lock reply
/unlock reply
〰〰〰
📌جلو گیری از دستورات عمومی
/lock cmd
/unlock cmd
〰〰〰
📌قفل خدمات تلگرام
/lock tgservic
/unlock tgservic
〰〰〰
📌خاموش و روشن کردن قفل خودکار گروه
/lock auto
/unlock auto
/setlockauto [زمان پایان زمان شروع]
📍 زمان را باید با فرمت صحیح استفاده کنید مثال :
/setlockauto 13:36 19:05
〰〰〰
📌خاموش و روشن کردن و تنظیم کاراکتر پیام
/lock character
/unlock character
/setlockcharacter [حداقل کاراکتر حداکثر کاراکتر]
📍 باید حتما به عدد وارد کنید مثال :
/setlockcharacter 10 320

➖➖➖
🔹برای دستورات انگلیسی ان هارو تایپ کنید و روی ان ها کلیک نکنید!

🔖بازکردن و قفل کردن هم از طریق پنل و هم از طریق دستور ممکن است

🔸مثال :
/lock link
/unlock link
➖➖➖",
               'reply_markup'=>json_encode([
                   'inline_keyboard'=>[
					 [
					 ['text'=>"🎉 کانال ما",'url'=>"https://telegram.me/$channel"],['text'=>"🔙 برگشت",'callback_data'=>'englishpanel']
					 ],
                     ]
               ])
           ]);
		   }else{
			Telegram('answerCallbackQuery',[
'callback_query_id'=>$membercall,
'text'=>"شما مدیر ربات نیستید ⚠️",
]);
    }
					}
						 elseif($data=="sudohelpfapanel"){
				 if (in_array($fromid,$Dev) ){
            Telegram('editmessagetext',[
                'chat_id'=>$chatid,
     'message_id'=>$messageid,
               'text'=>"📍 راهنمای دستورات سودو :
➖➖➖➖➖

🔸پنل مدیریت
💭دریافت پنل مدیریت ربات و ارسال پیام به گروه ها و ممبر ها

🔹مدیریت گروه ها
💭دریافت پنل مدیریت گروه های ربات

🔸ترک
💭خروج ربات از گروه

🔹حذف
💭حدف گروه از لیست گروه های پشتیبانی

🔸نصب
💭اضافه کردن گروه به لیست گروه های پشتیبانی

🔹تنظیم شارژ
💭تنظیم شارژ برای گروه مورد نظر

🔸ارسال شارژ [ایدی گروه]
💭فعال سازی شارژ برای گروه مورد نظر به مدت 30 روز

🔹ترک [ایدی گروه]
💭ترک ربات از گروه مورد نظر

🔸 مسدود همگانی [ایدی]
💭 مسدود کردن فرد هم از پیوی و هم از تمام گروه های ربات

🔹 ازاد همگانی [ایدی]
💭 خارج کردن فرد از لیست مسدودت همگانی

🔸 لیست مسدود همگانی
💭 مشاهده لیست مسدود همگانی ربات

➖➖➖
🔹ایموجی های ابتدای دستورات را وارد نکنید",
               'reply_markup'=>json_encode([
                   'inline_keyboard'=>[
					 [
					 ['text'=>"🎉 کانال ما",'url'=>"https://telegram.me/$channel"],['text'=>"🔙 برگشت",'callback_data'=>'farsipanel']
					 ],
                     ]
               ])
           ]);
		   }else{
			Telegram('answerCallbackQuery',[
'callback_query_id'=>$membercall,
'text'=>"شما ادمین ربات نیستید ⚠️",
]);
    }
					}
							elseif($data=="sudohelpenpanel"){
				 if (in_array($fromid,$Dev) ){
            Telegram('editmessagetext',[
                'chat_id'=>$chatid,
     'message_id'=>$messageid,
               'text'=>"📍 راهنمای دستورات سودو :
➖➖➖➖➖

/panel admin
💭دریافت پنل مدیریت ربات و ارسال پیام به گروه ها و ممبر ها

/panel group
💭دریافت پنل مدیریت گروه های ربات

/leave
💭خروج ربات از گروه

/rem
💭حدف گروه از لیست گروه های پشتیبانی

/add
💭اضافه کردن گروه به لیست گروه های پشتیبانی

/charge
💭تنظیم شارژ برای گروه مورد نظر

/sendcharge [ایدی گروه]
💭فعال سازی شارژ برای گروه مورد نظر به مدت 30 روز

/left [ایدی گروه]
💭ترک ربات از گروه مورد نظر

/banall [ایدی]
💭 مسدود کردن فرد هم از پیوی و هم از تمام گروه های ربات

/unbanall [ایدی]
💭 خارج کردن فرد از لیست مسدودت همگانی

/banlist
💭 مشاهده لیست مسدود همگانی ربات

➖➖➖
🔹برای دستورات انگلیسی ان هارو تایپ کنید و روی ان ها کلیک نکنید!

➖➖➖",
               'reply_markup'=>json_encode([
                   'inline_keyboard'=>[
					 [
					 ['text'=>"🎉 کانال ما",'url'=>"https://telegram.me/$channel"],['text'=>"🔙 برگشت",'callback_data'=>'englishpanel']
					 ],
                     ]
               ])
           ]);
		   }else{
			Telegram('answerCallbackQuery',[
'callback_query_id'=>$membercall,
'text'=>"شما ادمین ربات نیستید ⚠️",
]);
    }
					}
?>